Repository: janecekjiri/VoteVault
Catalog: VoteVault/App/Localizable.xcstrings
Source language: en
Languages: cs

# %@ %@ party_row_value
source: Party %1$@ with %2$@ percents.
cs: Strana %1$@ s %2$@ procenty.

# %@ chart_label
source: Party %@
cs: Strana %@

# %lld chart_value
source: %lld seats
cs: %lld mandátů

# add_toolbar_hint
source: Opens new screen to add a part
cs: Otevře obrazovku pro přidání strany

# add_toolbar_value
source: Add a party
cs: Přidat stranu

# alert_delete_all_parties_message
source: This action cannot be undone.
cs: Tato akce je nevratná.

# alert_delete_all_parties_title
source: Do you wish to delete all political parties?
cs: Přejete si smazat všechny politické strany?

source: Cancel
cs: Zrušit

# chart_party_label
source: Party
cs: Strana

# chart_seats_label
source: Seats
cs: Mandáty

# coalition_description
source: Indicates whether this subject is a coalition. Coalitions need 7% to get into parliament whereas singular political party needs only 5%.
cs: Značí, zda jde o koalici. Ta potřebuje překročit hranici 7%, zatímco samostatná strana pouze 5%.

# coalition_title
source: Coalition
cs: Koalice

# color_picker_hint
source: Opens color picker modal
cs: Otevře modál pro výběr barvy

# color_picker_label
source: Color picker button
cs: Tlačítko pro výběr barvy

# delete_toolbar_hint
source: Opens dialog to confirm deletion of all parties
cs: Otevře dialog pro potvrzení smazání všech stran

# delete_toolbar_value
source: Delete all parties
cs: Smazat všechny strany

# detail_cancel_button_hint
source: Closes the screen and returns to the previous one.
cs: Zavře obrazovku a vrátí se na předchozí

# detail_delete_alert_message
source: This action cannot be undone.
cs: Tato akce je nevratná.

# detail_delete_alert_title
source: Do you wish to delete this party?
cs: Přejete si smazat tuto stranu?

# detail_edit_title
source: Edit party
cs: Úprava strany

# detail_new_title
source: Create party
cs: Vytvoření strany

# detail_trash_hint
source: Shows alert for deleting this party
cs: Zobrazí dialog pro smazání této strany

# detail_trash_label
source: Delete party
cs: Smazat stranu

source: Evaluate
cs: Vyhodnotit

# evaluate_hint
source: Shows how many mandates each party gets.
cs: Zobrazí, kolik mandátů získá každá strana.

# explanation_text
source: Since there are 200 seats in Chamber of Deputies of the Czech Republic, you would rightly assume that seats of all parties add up to 200. However, that will most likely never be the case. How so? Unfortunately, the calculations for how many seats each party gets is not that straightforward. Of course the number of seats each party (or coalition) gets is highly dependent on how many percents of all votes they have. However, party's result in a specific region also plays a big role. That's why in 2021, despite coalition having the most votes (which resulted into 71 seats), ANO had the most seats (72). To further demonstrate how the current system is complicated, election expert Daniel Kerekes calculated that had SPOLU had gotten 3857-6003 less votes in South Bohemian Region, they would have had 72 seats while ANO would have dropped to 71. Since in our calculations we can only work with a very limited data set, the seats are calculated like this: (200 * party's support in percents) / total sum of percents of all parties that passed the minimal threshold
cs: Jelikož se ve volbách bojuje o 200 mandátů, správně byste očekávali, že součet mandátů všech stran je roven 200. Nicméně, tato situace zřejmě nikdy nenastane. Proč? Bohužel, výpočet počtu mandátů není ani zdaleka přímočarý. Samozřejmě, že počet mandátů nejvíce ovlivňuje, kolik procent daná strana (či koalice) dostala. To je ovšem také ovlivněno tím, jak si vede ve specifických krajích. Takto například v roce 2021 získalo nejvíce mandátů ANO (72), ačkoliv nejvíce hlasů dostala koalice SPOLU (71). Politolog a volební expert Daniel Kerekes dokonce přišel s tím, že kdyby koalice SPOLU v Jihočeském kraji získala o 3857 až 6003 hlasů méně, měla by 72 mandátů, zatímco ANO by si o 1 mandát pohoršilo. Jelikož naše výpočty pracují pouze s velmi omezeným množstvím dat, počet mandátů počítáme dle následujícího vzorce: (200 * podpora strany v procentech) / součet podpory všech stran, které by se do PS dostaly

# home_view_empty_message
source: Add new political parties by tapping + button in the top right corner.
cs: Přidejte nové politické strany tapnutím na tlačítko + v pravém horním rohu.

source: No
cs: Ne

# party_color_title
source: Party color
cs: Barva strany

# party_name_label
source: Text field for the name of political party
cs: Textové pole pro jméno politické strany

# party_name_placeholder
source: Insert party name
cs: Zadejte název strany

# party_name_title
source: Party name
cs: Název strany

# party_row_hint
source: Opens new screen to change details of this party.
cs: Otevře obrazovku na úpravu dat v tomto záznamu.

# percentages_label
source: Text field for the percentages of political party.
cs: Textové pole pro procenta politické strany.

# percentages_placeholder
source: Insert party support in %
cs: Zadejte podporu v %

# percentages_title
source: Percentages
cs: Procenta

# results_explanation_button
source: Why don't seats add up to 200?
cs: Proč není počet mandátů roven 200?

# results_explanation_button_hint
source: Opens new screen explaining Czech voting system and our calculations.
cs: Otevře obrazovku vysvětlující volební systém v Česku a naše kalkulace.

# results_title
source: Results
cs: Výsledky

source: Save
cs: Uložit

# tap_on_button_to_open_color_picker
source: Tap on button with colors to open color picker.
cs: Klikněte na tlačítko s barvami pro výběr barvy.

# tap_on_button_to_open_color_picker_label
source: Tap on button with colors to open color picker. It's the previous element.
cs: Klikněte na tlačítko s barvami pro výběr barvy. Jedná se o předchozí prvek.

source: Yes
cs: Ano
